# config.py
# نخزن هنا كل المعلومات الحساسة والإعدادات

BOT_TOKEN = "8045295596:AAFY4j0EcxqSFVipXTsfwjgQY5wcG9geUT0"
API_ID = 29127099
API_HASH = "0e322aaefced2db5c4dab5cc4107cd26"

# بيانات الفرق - نقلناها هنا لتخفيف الزحام في الكود
AFCON_TEAMS = {
    "🇩🇿 الجزائر": {"att": 92, "def": 89}, "🇲🇦 المغرب": {"att": 90, "def": 91},
    "🇪🇬 مصر": {"att": 88, "def": 90}, "🇹🇳 تونس": {"att": 85, "def": 88},
    "🇸🇳 السنغال": {"att": 91, "def": 89}, "🇳🇬 نيجيريا": {"att": 93, "def": 85},
    "🇨🇮 ساحل العاج": {"att": 89, "def": 88}, "🇨🇲 الكاميرون": {"att": 87, "def": 86}
}

TACTICS = {
    "counter": "high_press", "build_up": "park_bus", "long_shot": "offside_trap"
}
